{
  "name": "bltool",
  "full_name": "bltool",
  "tap": "homebrew/core",
  "oldname": null,
  "oldnames": [],
  "aliases": [],
  "versioned_formulae": [],
  "desc": "Tool for command-line interaction with backloggery.com",
  "license": "Apache-2.0",
  "homepage": "https://github.com/ToxicFrog/bltool",
  "versions": {
    "stable": "0.2.4",
    "head": "HEAD",
    "bottle": true
  },
  "urls": {
    "stable": {
      "url": "https://github.com/ToxicFrog/bltool/releases/download/v0.2.4/bltool-0.2.4.zip",
      "tag": null,
      "revision": null,
      "checksum": "5bef751aac7140f8a705b29edd35a7bfa9f87c36039d84d4001f16a307b64ef6"
    },
    "head": {
      "url": "https://github.com/ToxicFrog/bltool.git",
      "branch": "master"
    }
  },
  "revision": 0,
  "version_scheme": 0,
  "bottle": {
    "stable": {
      "rebuild": 1,
      "root_url": "https://ghcr.io/v2/homebrew/core",
      "files": {
        "all": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/bltool/blobs/sha256:9680f304971522be9ac9736b4678299bc88141866d987a25aeb66530574d1324",
          "sha256": "9680f304971522be9ac9736b4678299bc88141866d987a25aeb66530574d1324"
        }
      }
    }
  },
  "keg_only": false,
  "keg_only_reason": null,
  "options": [],
  "build_dependencies": [],
  "dependencies": [
    "openjdk"
  ],
  "test_dependencies": [],
  "recommended_dependencies": [],
  "optional_dependencies": [],
  "uses_from_macos": [],
  "uses_from_macos_bounds": [],
  "requirements": [],
  "conflicts_with": [],
  "conflicts_with_reasons": [],
  "link_overwrite": [],
  "caveats": null,
  "installed": [],
  "linked_keg": null,
  "pinned": false,
  "outdated": false,
  "deprecated": false,
  "deprecation_date": null,
  "deprecation_reason": null,
  "disabled": false,
  "disable_date": null,
  "disable_reason": null,
  "post_install_defined": false,
  "service": null,
  "tap_git_head": "2706c66e8def3eeba4d9bf1adf66221c8ad70701",
  "ruby_source_path": "Formula/bltool.rb",
  "ruby_source_checksum": {
    "sha256": "7003f86a9e90b08fb993556d46d901f8cbfa11f2bc2cbca7897aa74b005c3eb6"
  },
  "head_dependencies": {
    "build_dependencies": [
      "leiningen"
    ],
    "dependencies": [
      "openjdk"
    ],
    "test_dependencies": [],
    "recommended_dependencies": [],
    "optional_dependencies": [],
    "uses_from_macos": [],
    "uses_from_macos_bounds": []
  },
  "date_added": "2015-06-05T14:26:47+01:00",
  "readme": "# bltool\n\nA command line tool for managing a Backloggery game collection, including bulk add/delete and import from Steam and Xbox Live.\n\n**NOTE: This project is no longer maintained. It is known to have issues with the current version of the backloggery site.**\n\n## Installation\n\nDownload the [latest release from the Github releases page](https://github.com/ToxicFrog/bltool/releases) and unzip it. At this point you can import your games from Steam by editing `steam2backloggery.bat` (windows) or `steam2backloggery.sh` (Linux/OSX) to have the correct login information, then running it; if you need more contronl, you can run it directly from the command line with `java -jar bltool.jar <arguments>`.\n\nIf you want to build from source, it uses Leiningen, the standard Clojure build tool; use `lein uberjar` to build or `lein run` to run. To create a release zip, use `./release.sh <version>`.\n\n### Homebrew on Mac OS X\n\nYou can also install bltool using the [Homebrew](http://brew.sh/) package manager for Mac OS X.\n\n```\n$ brew update\n$ brew install bltool\n```\n\nTo upgrade bltool in the future, just use `upgrade` instead of `install`.\n\n## Usage\n\n    Usage: bltool <command> [<args>]\n\n     Switches                       Default  Desc\n     --------                       -------  ----\n     --from                                  What type of data source to read the games/edits from. Use '--help formats' for a list of formats.\n     --to                                    What type of destination to write the changes to. Use '--help formats' for a list of formats.\n     --steam-name                            Steam Community name\n     --steam-platform               PC       Default platform to use for Steam games (recommended: PC, PCDL, or Steam)\n     --xbox-name                             Xbox Live GamerTag\n     --xbox-360-platform            360      Default platform to use for Xbox 360 games (recommended: 360, Xbox, XBLA, XNA, or XbxGoD)\n     --xbox-one-platform            XBO      Default platform to use for Xbox One games (recommended: XBO, Xbox, XbxGoD)\n     --bl-name                               backloggery username\n     --bl-pass                               backloggery password\n     --bl-region                    0        backloggery region number to use for new games (0=USA, 1=Jpn, 2=PAL, 3=Chinao, 4=Korea, 5=Brazil)\n     --no-bl-stealth, --bl-stealth  true     use 'stealth add' and 'stealth edit' when updating backloggery\n     --help                                  Show detailed help. Try 'bltool --help (formats|usage)'\n     --filter-from                           Read a list of games from this source, and exclude them from the output.\n     --filter-input                          For file-based filters, read filter contents from this file.\n     --input                        -        For file-based formats, read input from this file. '-' means stdin.\n     --output                       -        For file-based formats, write output to this file. '-' means stdout.\n     --name                                  Include only games where the name contains this string.\n\nYou will need to at least specify `--from` and `--to` to specify input and output formats; some formats may require additional arguments. See the next session for details on how to use them.\n\n## Supported data sources/formats\n\n    This tool can read and write a variety of sources. The --from and --to\n    options control what formats it reads and write; the --input and --output\n    options control what file it writes to or reads from, for formats that are\n    stored in files.\n\n    Format       RW  Desc\n    ------       --  ----\n    backloggery  RW  Backloggery game library. When writing, equivalent to bl-add.\n    bl-add        W  Add new games to Backloggery.\n    bl-edit*     RW  Edit existing games, overwriting current information.\n                     In read mode, gets all game info, not just basic info (slow!)\n    bl-delete     W  Delete all listed games; all properties except ID are ignored.\n    steam        R   Game list from Steam Community\n    xboxlive     R   Game list from Xbox Live\n    html*         W  HTML file that can submit changes to Backloggery\n    text         RW  User-editable plain text\n    edn          RW  Machine-readable EDN\n    json         RW  Machine-readable JSON\n\n    * Not yet implemented\n\n### Instructions for specific formats\n\n* `backloggery`, `bl-add`, `bl-edit`, `bl-delete`\n\n  These all read or modify your backloggery game list. You'll need to specify `--bl-name` and `--bl-pass` so that it can log in to backloggery as you. If adding games, you might want to also use `--filter`, which will exclude games already on your backloggery. If you want bulk adds/deletes to show up on your multitap, use `--no-bl-stealth` as well.\n\n* `steam`\n\n  This reads your Steam game list from `http://steamcommunity.com/id/<name>`. This means that your Steam profile has to be public, and you need to use `--steam-name` to tell it what name to use. This needs to be the name that appears in your Steam Community URL, *not* your Steam login name or display name. The default platform it uses for games from Steam is \"PC\"; you can use `--steam-platform` to override this.\n\n  This version will now automatically tag games imported from Steam as unfinished (rather than unplayed) if Steam has hours on record for the game. Bear in mind that games you've played offline or games you played before Steam tracked hours might not be detected this way.\n\n* `xboxlive`\n\n  This reads your Xbox Live game list from your Xbox Profile. This means that your XBLA profile has to be public, and you need to use `--xbox-name` to tell it what GamerTag to use. This needs to be your GamerTag, not your Microsoft Account e-mail address. By default it reads both Xbox 360 and Xbox One games (if you have them) and uses the appropriate platform for them; you can use `--xbox-360-platform` or `--xbox-one-platform` to override this. All Xbox games are imported as unfinished since generally they must have been played to show up in the Xbox Live register. In addition, games are imported as completed if you have 100% of their GamerScore.\n\n  This functionality depends on a free account from xboxapi.com which is subject to usage limitations. Since the usage limit is 120 requests per hour and a full import only requires 3 requests, this shouldn't be too much of a problem, but if this service does break or go away then this function will no longer work.\n\n* `text`\n\n  This is a tab-separated format, one line per game, with the fields `ID`, `platform`, `status`, and `name`. `ID` is the Backloggery game ID (or 0 for games that weren't imported from Backloggery). `platform` is the game's platform; it defaults to PC but can be any platform Backloggery supports. `status` is one of \"unplayed\", \"unfinished\", \"beaten\", \"completed\", \"mastered\", or \"null\". Name can contain anything at all (including tabs and other whitespace) and is thus the last field.\n\n  The platform needs to be the platform ID that backloggery uses; for example, \"PCDL\", not \"PC Downloads\". At the moment the only way to get a complete list is to \"view source\" on backloggery's add-a-game page.\n\n  This is a file oriented format, so you probably want `--input <file>` (when using `--from text`) or `--output <file>` (when using `--to text`). Otherwise it will read from and write to the terminal.\n\n* `edn`\n\n  This saves or loads the game list in [Extensible Data Notation](https://github.com/edn-format/edn) format. It is primarily useful if you want the game list in a machine-readable format for use with other tools.\n\n  Like text, it is file-oriented and should be combined with `--input` or `--output`.\n\n## Examples\n\nDownload your game list from backloggery for a look:\n\n    bltool --from backloggery --to text --output games.txt --bl-name MyName --bl-pass TopSecret\n\nImport your game list from Steam to Backloggery, editing the game list first. Note that you need the backloggery login options for --filter to work, since this also downloads your backloggery game list and excludes any games you already have there.\n\n    bltool --from steam --to text --output games.txt --steam-name MyName --bl-name MyName --bl-pass TopSecret --filter-from backloggery\n    edit games.txt\n    bltool --from text --to backloggery --input games.txt --bl-name MyName --bl-pass TopSecret\n\nImport your game list from Steam in one step with no editing, filtering out games already on backloggery:\n\n    bltool --from steam --to backloggery --steam-name MyName --bl-name MyName --bl-pass TopSecret --filter\n\nFilter out duplicates from your Backloggery game list (in one step - you probably want to double-check this first, in reality!):\n\n    bltool --from backloggery --bl-name MyName --bl-pass TopSecret --output text \\\n    | sort | uniq -d -f3 \\\n    | bltool --from text --to bl-delete --bl-name MyName --bl-pass TopSecret\n\nRemove all of your DLC from backloggery, using \"stealth delete\":\n\n    bltool --from backloggery --to bl-delete --name DLC --bl-stealth --bl-pass TopSecret --output text\n\n### Bugs\n\nTwo features (html output and backloggery edit support) are not yet implemented.\n\nApart from that, bug reports are welcome! Post them on github and it'll email me.\n\n## License\n\nCopyright © 2013 Ben \"ToxicFrog\" Kelly, Google Inc.\n\nDistributed under the Apache License v2; see the file LICENSE for details."
}
