{
  "name": "envconsul",
  "full_name": "envconsul",
  "tap": "homebrew/core",
  "oldname": null,
  "oldnames": [],
  "aliases": [],
  "versioned_formulae": [],
  "desc": "Launch process with environment variables from Consul and Vault",
  "license": "MPL-2.0",
  "homepage": "https://github.com/hashicorp/envconsul",
  "versions": {
    "stable": "0.13.2",
    "head": null,
    "bottle": true
  },
  "urls": {
    "stable": {
      "url": "https://github.com/hashicorp/envconsul.git",
      "tag": "v0.13.2",
      "revision": "dd416cebc7373914548a2df69af0a97c9432ef91",
      "checksum": null
    }
  },
  "revision": 0,
  "version_scheme": 0,
  "bottle": {
    "stable": {
      "rebuild": 0,
      "root_url": "https://ghcr.io/v2/homebrew/core",
      "files": {
        "arm64_ventura": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/envconsul/blobs/sha256:787d365fe17ad5b3de36bcf0ab9ff02a01e5ce5ac31c859ece7efd868c27c206",
          "sha256": "787d365fe17ad5b3de36bcf0ab9ff02a01e5ce5ac31c859ece7efd868c27c206"
        },
        "arm64_monterey": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/envconsul/blobs/sha256:787d365fe17ad5b3de36bcf0ab9ff02a01e5ce5ac31c859ece7efd868c27c206",
          "sha256": "787d365fe17ad5b3de36bcf0ab9ff02a01e5ce5ac31c859ece7efd868c27c206"
        },
        "arm64_big_sur": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/envconsul/blobs/sha256:787d365fe17ad5b3de36bcf0ab9ff02a01e5ce5ac31c859ece7efd868c27c206",
          "sha256": "787d365fe17ad5b3de36bcf0ab9ff02a01e5ce5ac31c859ece7efd868c27c206"
        },
        "ventura": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/envconsul/blobs/sha256:76477948a712b91bc3a69e51ea06476e3ea0d6fb6638f09c482ab8cf54e04786",
          "sha256": "76477948a712b91bc3a69e51ea06476e3ea0d6fb6638f09c482ab8cf54e04786"
        },
        "monterey": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/envconsul/blobs/sha256:76477948a712b91bc3a69e51ea06476e3ea0d6fb6638f09c482ab8cf54e04786",
          "sha256": "76477948a712b91bc3a69e51ea06476e3ea0d6fb6638f09c482ab8cf54e04786"
        },
        "big_sur": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/envconsul/blobs/sha256:76477948a712b91bc3a69e51ea06476e3ea0d6fb6638f09c482ab8cf54e04786",
          "sha256": "76477948a712b91bc3a69e51ea06476e3ea0d6fb6638f09c482ab8cf54e04786"
        },
        "x86_64_linux": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/envconsul/blobs/sha256:7c9a3eef22e1fb333f855e770754d15df7c5e996ed7a387d465f1daf0bfb2b2d",
          "sha256": "7c9a3eef22e1fb333f855e770754d15df7c5e996ed7a387d465f1daf0bfb2b2d"
        }
      }
    }
  },
  "keg_only": false,
  "keg_only_reason": null,
  "options": [],
  "build_dependencies": [
    "go"
  ],
  "dependencies": [],
  "test_dependencies": [
    "consul"
  ],
  "recommended_dependencies": [],
  "optional_dependencies": [],
  "uses_from_macos": [],
  "uses_from_macos_bounds": [],
  "requirements": [],
  "conflicts_with": [],
  "conflicts_with_reasons": [],
  "link_overwrite": [],
  "caveats": null,
  "installed": [],
  "linked_keg": null,
  "pinned": false,
  "outdated": false,
  "deprecated": false,
  "deprecation_date": null,
  "deprecation_reason": null,
  "disabled": false,
  "disable_date": null,
  "disable_reason": null,
  "post_install_defined": false,
  "service": null,
  "tap_git_head": "4eeae4ea50839e967536ba646d5e0ed6fbcbad7f",
  "ruby_source_path": "Formula/envconsul.rb",
  "ruby_source_checksum": {
    "sha256": "14cfc4e19217519cf0c49d0254588a7cafd8c2c3cc704ce6e365a3e6645799b4"
  },
  "date_added": "2017-11-23T10:24:23-08:00",
  "readme": "[![Go Reference](https://pkg.go.dev/badge/github.com/hashicorp/envconsul.svg)](https://pkg.go.dev/github.com/hashicorp/envconsul)\n[![build](https://github.com/hashicorp/envconsul/actions/workflows/build.yml/badge.svg)](https://github.com/hashicorp/envconsul/actions/workflows/build.yml)\n[![ci](https://github.com/hashicorp/envconsul/actions/workflows/ci.yml/badge.svg)](https://github.com/hashicorp/envconsul/actions/workflows/ci.yml)\n\nEnvconsul provides a convenient way to launch a subprocess with environment\nvariables populated from HashiCorp [Consul][consul] and [Vault][vault]. The tool\nis inspired by [envdir][envdir] and [envchain][envchain], but works on many\nmajor operating systems with no runtime requirements. It is also available\nvia a Docker container for scheduled environments.\n\nEnvconsul supports [12-factor applications][12-factor] which get their\nconfiguration via the environment. Environment variables are dynamically\npopulated from Consul or Vault, but the application is unaware; applications\njust read environment variables. This enables extreme flexibility and\nportability for applications across systems.\n\n**The documentation in this README corresponds to the master branch of envconsul. It may contain unreleased features or different APIs than the most recently released version. Please see the Git tag that corresponds to your version of envconsul for the proper documentation.**\n\n## Community Support\n\nIf you have questions about how envconsul works, its capabilities or anything\nother than a bug or feature request (use github's issue tracker for those),\nplease see our community support resources.\n\nCommunity portal: https://discuss.hashicorp.com/tags/c/consul/29/envconsul\n\nOther resources: https://www.consul.io/community.html\n\nAdditionally, for issues and pull requests, we'll be using the :+1: reactions\nas a rough voting system to help gauge community priorities. So please add :+1:\nto any issue or pull request you'd like to see worked on. Thanks.\n\n\n## Installation\n\n### Pre-Compiled\n\n1. Download a pre-compiled, released version from the [envconsul\n  releases][releases] page. You can download zip or tarball.\n\n1. Extract the binary using `unzip` or `tar`.\n\n1. Move the binary into your `$PATH`.\n\nTo compile from source, please see the instructions in the\n[contributing section](#contributing).\n\n### From Source (Go)\n\n1. Install common build tools and [go][go].\n\n1. Clone the repository from GitHub.\n\n    ```shell\n    $ git clone https://github.com/hashicorp/envconsul.git\n    $ cd envconsul\n    ```\n\n1. Run the development make target.\n\n    ```shell\n    $ make dev\n    ```\n\n1. Or run the make target for your platform and architecture.\n\n    ```shell\n    $ make darwin/amd64 # or linux/amd64 or windows/amd64, etc\n    ```\n\nThis process will build `envconsul` into `pkg/OS_ARCH`. You can move this into\nyour path or execute it directly.\n\n## Quick Example\n\nThis short example assumes Consul is installed locally.\n\n1. Start a Consul cluster in dev mode.\n\n    ```shell\n    $ consul agent -dev\n    ```\n\n1. Write some data.\n\n    ```shell\n    $ consul kv put my-app/address 1.2.3.4\n    $ consul kv put my-app/port 80\n    $ consul kv put my-app/max_conns 5\n    ```\n\n1. Execute envconsul with a subprocess (`env` in this example).\n\n    ```shell\n    $ envconsul -prefix my-app env\n    ```\n\n    Envconsul will connect to Consul, read the data from the key-value store,\n    and populate environment variables corresponding to those values. Here is\n    sample output.\n\n    ```text\n    address=1.2.3.4\n    max_conns=5\n    port=80\n    ```\n\nFor more examples and use cases, please see the [examples](#Examples) in\nthis README.\n\n## Usage\n\nFor the full list of command-line options:\n\n```shell\n$ envconsul -h\n```\n\n### Command Line Interface (CLI)\n\nThe Envconsul CLI interface supports most of the options in the configuration file and\nvisa-versa. Here are some common examples of CLI usage. For the full list of\noptions, please run `envconsul -h`.\n\nRender data from the prefix `my-app` into the environment.\n\n```shell\n$ envconsul -prefix my-app ruby my-app.rb\n```\n\nRender _only_ data from the two prefixes into the environment (the parent\nprocesses environment will not be copied).\n\n```shell\n$ envconsul -pristine -prefix common -prefix my-app yarn start\n```\n\nConvert environment variables to upcase and remove any non-standard keys (like\ndashes to underscores).\n\n```shell\n$ envconsul -upcase -sanitize -prefix my-app python my-app.my\n```\n\nRead information about service.\n```shell\n$ envconsul -service-query my-service\n```\n\nRead secrets from Vault.\n\n```shell\n$ envconsul -secret secret/my-app ./my-app\n```\n\n### Configuration File\n\nConfiguration files are written in the [HashiCorp Configuration Language][hcl].\nBy proxy, this means the configuration is also JSON compatible.\n\n```hcl\n# This denotes the start of the configuration section for Consul. All values\n# contained in this section pertain to Consul.\nconsul {\n  # This block specifies the basic authentication information to pass with the\n  # request. For more information on authentication, please see the Consul\n  # documentation.\n  auth {\n    enabled  = true\n    username = \"test\"\n    password = \"test\"\n  }\n\n  # This is the address of the Consul agent. By default, this is\n  # 127.0.0.1:8500, which is the default bind and port for a local Consul\n  # agent. It is not recommended that you communicate directly with a Consul\n  # server, and instead communicate with the local Consul agent. There are many\n  # reasons for this, most importantly the Consul agent is able to multiplex\n  # connections to the Consul server and reduce the number of open HTTP\n  # connections. Additionally, it provides a \"well-known\" IP address for which\n  # clients can connect.\n  address = \"127.0.0.1:8500\"\n\n  # This is the ACL token to use when connecting to Consul. If you did not\n  # enable ACLs on your Consul cluster, you do not need to set this option.\n  #\n  # This option is also available via the environment variable CONSUL_TOKEN.\n  token = \"abcd1234\"\n\n  # This controls the retry behavior when an error is returned from Consul.\n  # Envconsul is highly fault tolerant, meaning it does not exit in the face\n  # of failure. Instead, it uses exponential back-off and retry functions\n  # to wait for the cluster to become available, as is customary in distributed\n  # systems.\n  retry {\n    # This enabled retries. Retries are enabled by default, so this is\n    # redundant.\n    enabled = true\n\n    # This specifies the number of attempts to make before giving up. Each\n    # attempt adds the exponential backoff sleep time. Setting this to\n    # zero will implement an unlimited number of retries.\n    attempts = 12\n\n    # This is the base amount of time to sleep between retry attempts. Each\n    # retry sleeps for an exponent of 2 longer than this base. For 5 retries,\n    # the sleep times would be: 250ms, 500ms, 1s, 2s, then 4s.\n    backoff = \"250ms\"\n\n    # This is the maximum amount of time to sleep between retry attempts.\n    # When max_backoff is set to zero, there is no upper limit to the\n    # exponential sleep between retry attempts.\n    # If max_backoff is set to 10s and backoff is set to 1s, sleep times\n    # would be: 1s, 2s, 4s, 8s, 10s, 10s, ...\n    max_backoff = \"1m\"\n  }\n\n  # This block configures the SSL options for connecting to the Consul server.\n  ssl {\n    # This enables SSL. Specifying any option for SSL will also enable it.\n    enabled = true\n\n    # This enables SSL peer verification. The default value is \"true\", which\n    # will check the global CA chain to make sure the given certificates are\n    # valid. If you are using a self-signed certificate that you have not added\n    # to the CA chain, you may want to disable SSL verification. However, please\n    # understand this is a potential security vulnerability.\n    verify = false\n\n    # This is the path to the certificate to use to authenticate. If just a\n    # certificate is provided, it is assumed to contain both the certificate and\n    # the key to convert to an X509 certificate. If both the certificate and\n    # key are specified, Envconsul will automatically combine them into an X509\n    # certificate for you.\n    cert = \"/path/to/client/cert\"\n    key  = \"/path/to/client/key\"\n\n    # This is the path to the certificate authority to use as a CA. This is\n    # useful for self-signed certificates or for organizations using their own\n    # internal certificate authority.\n    ca_cert = \"/path/to/ca\"\n\n    # This is the path to a directory of PEM-encoded CA cert files. If both\n    # `ca_cert` and `ca_path` is specified, `ca_cert` is preferred.\n    ca_path = \"path/to/certs/\"\n\n    # This sets the SNI server name to use for validation.\n    server_name = \"my-server.com\"\n  }\n}\n\n# This block defines the configuration of the child process to execute and\n# manage.\nexec {\n  # This is the command to execute as a child process. There can be only one\n  # command per process.\n  command = \"/usr/bin/app\"\n\n  # This is a random splay to wait before killing the command. The default\n  # value is 0 (no wait), but large clusters should consider setting a splay\n  # value to prevent all child processes from reloading at the same time when\n  # data changes occur. When this value is set to non-zero, Envconsul will wait\n  # a random period of time up to the splay value before killing the child\n  # process. This can be used to prevent the thundering herd problem on\n  # applications that do not gracefully reload.\n  splay = \"5s\"\n\n  env {\n    # This specifies if the child process should not inherit the parent\n    # process's environment. By default, the child will have full access to the\n    # environment variables of the parent. Setting this to true will send only\n    # the values specified in `custom_env` to the child process.\n    pristine = false\n\n    # This specifies additional custom environment variables in the form shown\n    # below to inject into the child's runtime environment. If a custom\n    # environment variable shares its name with a system environment variable,\n    # the custom environment variable takes precedence. Even if pristine,\n    # allowlist, or denylist is specified, all values in this option\n    # are given to the child process.\n    custom = [\"PATH=$PATH:/etc/myapp/bin\"]\n\n    # This specifies a list of environment variables to exclusively include in\n    # the list of environment variables exposed to the child process. If\n    # specified, only those environment variables matching the given patterns\n    # are exposed to the child process. These strings are matched using Go's\n    # glob function, so wildcards are permitted.\n    allowlist = [\"CONSUL_*\"]\n\n    # This specifies a list of environment variables to exclusively prohibit in\n    # the list of environment variables exposed to the child process. If\n    # specified, any environment variables matching the given patterns will not\n    # be exposed to the child process, even if they are in the allowlist. The\n    # values in this option take precedence over the values in the allowlist.\n    # These strings are matched using Go's glob function, so wildcards are\n    # permitted.\n    denylist = [\"VAULT_*\"]\n  }\n\n  # This defines the signal sent to the child process when Envconsul is\n  # gracefully shutting down. The application should begin a graceful cleanup.\n  # If the application does not terminate before the `kill_timeout`, it will\n  # be terminated (effectively \"kill -9\"). The default value is shown below.\n  kill_signal = \"SIGTERM\"\n\n  # This defines the amount of time to wait for the child process to gracefully\n  # terminate when Envconsul exits. After this specified time, the child\n  # process will be force-killed (effectively \"kill -9\"). The default value is\n  # \"30s\".\n  kill_timeout = \"2s\"\n}\n\n# This is the signal to listen for to trigger a graceful stop. The default\n# value is shown below. Setting this value to the empty string will cause it\n# to not listen for any graceful stop signals.\nkill_signal = \"SIGINT\"\n\n# This is the log level. If you find a bug in Envconsul, please enable debug or\n# trace logs so we can help identify the issue. This is also available as a\n# command line flag.\nlog_level = \"warn\"\n\n# This is the maximum interval to allow \"stale\" data. By default, only the\n# Consul leader will respond to queries; any requests to a follower will\n# forward to the leader. In large clusters with many requests, this is not as\n# scalable, so this option allows any follower to respond to a query, so long\n# as the last-replicated data is within these bounds. Higher values result in\n# less cluster load, but are more likely to have outdated data.\nmax_stale = \"10m\"\n\n# This is the path to store a PID file which will contain the process ID of the\n# Envconsul process. This is useful if you plan to send custom signals\n# to the process.\npid_file = \"/path/to/pid\"\n\n# This specifies a prefix in Consul to watch. This may be specified multiple\n# times to watch multiple prefixes, and the bottom-most prefix takes\n# precedence, should any values overlap. Prefix blocks without the path\n# defined are meaningless and are discarded. If prefix names conflict with\n# secret names, secret names will take precedence.\nprefix {\n  # This tells Envconsul to use a custom formatter when printing the key. The\n  # value between `{{ key }}` will be replaced with the key.\n  format = \"custom_{{ key }}\"\n\n  # This tells Envconsul to use a custom formatter when printing the key. The\n  # value after \"replaceKey\" in  `{{ key | replaceKey `actualKey` `expectedKey` }}` will be replaced with the next value.\n  # You could replace more then one key.\n  format = \"custom_{{ key | replaceKey `actualKey1` `expectedKey1` | replaceKey `actualKey2` `expectedKey2` }}\"  \n\n  # This tells Envconsul to not prefix the keys with their parent \"folder\".\n  # The default for `prefix` (consul) is true, the default for `secret` (vault)\n  # is false. The differing defaults is to maintain backward compatibility.\n  no_prefix = false\n\n  # This is the path of the key in Consul or Vault from which to read data.\n  # The path field is required or the config block will be ignored.\n  path = \"foo/bar\"\n\n  # This tells Envconsul to use a custom formatter when building the path for\n  # the key from which to read data, in this case reading an environment\n  # variable and putting it into the path.\n  path = \"foo/{{ env \\\"BAR\\\" }}\"\n}\n\n# This tells Envconsul to not include the parent processes' environment when\n# launching the child process.\npristine = false\n\n# This is the signal to listen for to trigger a reload event. The default\n# value is shown below. Setting this value to the empty string will cause it\n# to not listen for any reload signals.\nreload_signal = \"SIGHUP\"\n\n# This tell Envconsul to remove any non-standard values from environment\n# variable keys and replace them with underscores.\nsanitize = false\n\n# This specifies a secret in Vault to watch. This may be specified multiple\n# times to watch multiple secrets, and the bottom-most secret takes\n# precedence, should any values overlap. Secret blocks without the path\n# defined are meaningless and are discarded. If secret names conflict with\n# prefix names, secret names will take precedence.\nsecret {\n  # See `prefix` as they are the same options.\n}\n\n# This block defines the configuration for connecting to a syslog server for\n# logging.\nsyslog {\n  # This enables syslog logging. Specifying any other option also enables\n  # syslog logging.\n  enabled = true\n\n  # This is the name of the syslog facility to log to.\n  facility = \"LOCAL5\"\n}\n\n# This tells Envconsul to convert environment variable keys to uppercase (which\n# is more common and a bit more standard).\nupcase = false\n\n# This denotes the start of the configuration section for Vault. All values\n# contained in this section pertain to Vault.\nvault {\n  # This is the address of the Vault leader. The protocol (http(s)) portion\n  # of the address is required.\n  address = \"https://vault.service.consul:8200\"\n\n  # This is a Vault Enterprise namespace to use for reading/writing secrets.\n  #\n  # This value can also be specified via the environment variable VAULT_NAMESPACE.\n  namespace = \"foo\"\n\n  # This is the token to use when communicating with the Vault server.\n  # Like other tools that integrate with Vault, Envconsul makes the\n  # assumption that you provide it with a Vault token; it does not have the\n  # incorporated logic to generate tokens via Vault's auth methods.\n  #\n  # This value can also be specified via the environment variable VAULT_TOKEN.\n  token = \"abcd1234\"\n\n  # This tells Envconsul to load the Vault token from the contents of a file.\n  # If this field is specified:\n  # - by default Envconsul will not try to renew the Vault token, if you want it\n  # to renew you will need to specify renew_token = true as below.\n  # - Envconsul will periodically stat the file and update the token if it has\n  # changed.\n  # vault_agent_token_file = \"/path/to/vault/agent/token/file\"\n\n\n  # This tells Envconsul that the provided token is actually a wrapped\n  # token that should be unwrapped using Vault's cubbyhole response wrapping\n  # before being used. Please see Vault's cubbyhole response wrapping\n  # documentation for more information.\n  unwrap_token = true\n\n  # This option tells Envconsul to automatically renew the Vault token given.\n  # If you are unfamiliar with Vault's architecture, Vault requires tokens be\n  # renewed at some regular interval or they will be revoked. Envconsul will\n  # automatically renew the token at half the lease duration of the token. The\n  # default value is true (exception below), but this option can be disabled if\n  # you want to renew the Vault token using an out-of-band process.\n  # \n  # There is an exception to the default such that if vault_agent_token_file is\n  # set, either from the command line or the above option, renew_token defaults\n  # to false to avoid renewal conflicts between envconsul and vault-agent.\n  #\n  # Note that secrets specified as a prefix are always renewed, even if this\n  # option is set to false. This option only applies to the top-level Vault\n  # token itself.\n  renew_token = true\n\n  # This is a role name for k8s auth method. It will be ignored if \"token\" set.\n  # This option enables the kubernetes auth method that provies a way\n  # to authenticate Vault using a Kubernetes Service Account Token.\n  # This method of authentication makes it easy to introduce a Vault\n  # token into a Kubernetes Pod.\n  # The default value is \"\".\n  k8s_auth_role_name = \"\"\n\n  # This is the path of file that contains service token for k8s auth method.\n  # It will be ignored if \"k8s_service_account_token\" set.\n  # The default value is \"/run/secrets/kubernetes.io/serviceaccount/token\".\n  k8s_service_account_token_path = \"/run/secrets/kubernetes.io/serviceaccount/token\"\n\n  # Value of an account token for k8s auth method. If set, then it will be used\n  # instead of \"k8s_service_account_token_path\".\n  # The default value is \"\".\n  k8s_service_account_token = \"some_token\"\n\n  # This is a part of k8s login path, by default the value is \"kubernetes\",\n  # which means to use login path as \"auth/kubernetes/login\".\n  k8s_service_mount_path = \"kubernetes\"\n\n  # This section details the retry options for connecting to Vault. Please see\n  # the retry options in the Consul section for more information (they are the\n  # same).\n  retry {\n    # ...\n  }\n\n  # This section details the SSL options for connecting to the Vault server.\n  # Please see the SSL options in the Consul section for more information (they\n  # are the same).\n  ssl {\n    # ...\n  }\n\n# This specifies a service in Consul to watch. This may be specified multiple\n# times to watch multiple prefixes, and the bottom-most service takes\n# precedence, should any values overlap.\nservice {\n  # This is the query of the service in Consul from which to read data.\n  query = \"my-service\"\n\n  # This tells Envconsul to use a custom formatter when printing the key. The\n  # value between `{{ key }}` and `{{ service }}` will be replaced with the key\n  # and service name. Default format `{{ service }}/{{ key }}`\n  format_id = \"pg/{{ key }}\"\n  format_name = \"pg/{{ key }}\"\n  format_address = \"pg/host\"\n  format_tag = \"pg/{{ key }}\"\n  format_port = \"pg/{{ key }}\"\n}\n\n# This is the quiescence timers; it defines the minimum and maximum amount of\n# time to wait for the cluster to reach a consistent state before relaunching\n# the app. This is useful to enable in systems that have a lot of flapping,\n# because it will reduce the the number of times the app is restarted.\nwait {\n  min = \"5s\"\n  max = \"10s\"\n}\n```\n\nNote that not all fields are required. If you are not retrieving secrets from\nVault, you do not need to specify a Vault configuration section. Similarly, if\nyou are not logging to syslog, you do not need to specify a syslog\nconfiguration.\n\nFor additional security, tokens may also be read from the environment using the\n`CONSUL_TOKEN` or `VAULT_TOKEN` environment variables respectively. It is highly\nrecommended that you do not put your tokens in plain-text in a configuration\nfile.\n\nInstruct Envconsul to use a configuration file with the `-config` flag:\n\n```shell\n$ envconsul -config \"config.hcl\"\n```\n\nThis argument may be specified multiple times to load multiple configuration\nfiles. The right-most configuration takes the highest precedence. If the path to\na directory is provided (as opposed to the path to a file), all of the files in\nthe given directory will be merged in\n[lexical order](http://golang.org/pkg/path/filepath/#Walk), recursively. Please\nnote that symbolic links are _not_ followed.\n\n**Commands specified on the CLI take precedence over a config file!**\n\n**Vault secrets always take precedence over consul prefixes. This is to mitigate\n**a security vulnerability!**\n\n### Signals\n\nBy default, almost all signals are proxied to the child process, with some\nexceptions. There are multiple configuration options related to signals.\n\n- `kill_signal` - This is the signal that Envconsul should listen for to kill\n  _itself_. This is useful when you want your application to respond to a\n  different signal than the child process.\n\n- `reload_signal` - This is the signal that Envconsul should listen for to\n  reload its own configuration. This is useful when using configuration files.\n  This signal will not be proxied to the child process if configured. By\n  specifying this as the empty string, Envconsul will not listen for reload\n  signals.\n\n- `exec.kill_signal` - This is the signal that Envconsul will send to the\n  child process to gracefully terminate it. This is the signal that your child\n  application listens to for graceful termination.\n\n## Examples\n\n### Redis\n\nRedis is a command key-value storage engine. If Redis is configured to read the\ngiven environment variables, you can use `envconsul` to start and manage the\nprocess:\n\n```shell\n# Ensure \"daemonize no\" is set in the redis configuration first.\n$ envconsul \\\n  -consul demo.consul.io \\\n  -prefix redis/config \\\n  redis-server [opts...]\n```\n\n### Env\n\nThis example is a great way to see `envconsul` in action. In practice, it is\nunlikely to be a useful use of envconsul though:\n\n```shell\n$ envconsul \\\n  -consul=demo.consul.io \\\n  -prefix redis/config \\\n  -once \\\n  env\nADDRESS=1.2.3.4\nPORT=55\n```\n\nWe can also ask envconsul to poll for configuration changes and automatically\nrestart the process:\n\n```\n$ envconsul \\\n  -consul=demo.consul.io \\\n  -prefix redis/config \\\n  python -c 'import os, time; print os.environ; time.sleep(1000);'\n{ 'ADDRESS': '1.2.3.4', 'PORT': '55' }\n-----\n{ 'ADDRESS': '1.2.3.4' }\n-----\n{ 'ADDRESS': '1.2.3.4', 'MAXCONNS': '50' }\n-----\n```\n\n### Vault\n\nWith the Vault integration, it is possible to pull secrets from Vault directly\ninto the environment using envconsul. The only restriction is that the data must\nbe \"flat\" and all keys and values must be strings or string-like values.\nenvconsul will return an error if you try to read from a value that returns a\nmap, for example.\n\nFirst, you must add the vault address and token information to the configuration\nfile. The configuration can also be set via command-line flags to `envconsul`:\n\n```hcl\nvault {\n  address     = \"https://vault.service.consul:8200\"\n  token       = \"abcd1234\" # May also be specified via the envvar VAULT_TOKEN\n  renew_token = true\n\n  ssl {\n    enabled = true\n    verify  = true\n    cert    = \"/path/to/client/cert.pem\"\n    ca_cert = \"/path/to/ca/cert.pem\"\n  }\n}\n```\n\nAssuming a secret exists at secret/passwords that was created like so:\n\n```sh\n$ vault write secret/passwords username=foo password=bar\n```\n\nenvconsul can pull those values into the environment:\n\n```text\n$ envconsul \\\n    -config=\"./config.hcl\" \\\n    -secret=\"secret/passwords\" \\\n    env\n\nsecret_passwords_username=foo\nsecret_passwords_password=bar\n```\n\nNotice that the environment variables are prefixed with the path. The slashes in\nthe path are converted to underscores, followed by the key:\n\n```text\nsecret/passwords     => secret_passwords\nmysql/creds/readonly => mysql_creds_readonly\n```\n\nThis behavior may be disabled by setting `no_prefix`\n\n```javascript\nsecret {\n  no_prefix = true\n  path      = \"secret/passwords\"\n}\n\nusername=foo\npassword=bar\n```\n\nYou can also apply key transformations to the data:\n\n```text\n$ envconsul \\\n    -config=\"./config.hcl\" \\\n    -secret=\"mysql/creds/readonly\" \\\n    -upcase \\\n    env\n\nMYSQL_CREDS_READONLY_USERNAME=root-aefa635a-18\nMYSQL_CREDS_READONLY_PASSWORD=132ae3ef-5a64-7499-351e-bfe59f3a2a21\n```\n\nIt is highly encouraged that you specify the format for vault keys to include a\ncommon prefix, like:\n\n```hcl\nsecret {\n  path   = \"secret/passwords\"\n  format = \"secret_{{ key }}\"\n}\n```\n\nThe format string is passed to the go formatter and \"{{ key }}\" dictates where\nthe key will go. This will help filter out the environment when execing to a\nchild-process, for example.\n\nIn case, you need only a subset of keys from a Vault prefix, you can achieve this by applying a per-key configuration:\n\n```hcl\nsecret {\n  path   = \"secret/passwords\"\n  key {\n    name   = \"username\"\n  }\n}\n```\n\n```shell\n$ envconsul \\\n    -config=\"./config.hcl\" \\\n    env\n\nsecret_passwords_username=foo\n```\n\nIt is also possible to apply a per-key formatting that behaves the same as the `secret` level `format` option:\n\n```hcl\nsecret {\n  path   = \"secret/passwords\"\n  key {\n    name   = \"username\"\n    format = \"readonly_user_{{ key }}\"\n  }\n  key {\n    name   = \"password\"\n    format = \"custom_prefix_{{ key }}\"\n  }\n}\n```\n\n```shell\n$ envconsul \\\n    -config=\"./config.hcl\" \\\n    env\n\nsecret_passwords_readonly_user_username=foo\nsecret_passwords_custom_prefix_password=bar\n```\n\n**NOTE**: per-key configuration works **only** in case of absence of `secret`-level `format` configuration option.\n\nHence, the following set-up skips per-key configuration in favor of `format` from the top level `secret` block:\n\n```hcl\nsecret {\n  path   = \"secret/passwords\"\n  format = \"creds_{{ key }}\"\n\n  key {\n    name   = \"username\"\n    format = \"readonly_user_{{ key }}\"\n  }\n  key {\n    name   = \"password\"\n    format = \"custom_prefix_{{ key }}\"\n  }\n}\n```\n\n```shell\n$ envconsul \\\n    -config=\"./config.hcl\" \\\n    env\n\nsecret_passwords_creds_username=foo\nsecret_passwords_creds_password=bar\n```\n\nIf you need the same secret to be available under\ndifferent env var name,\nthis could be achieved by applying another format\nfor the same secret key:\n\n```hcl\nsecret {\n  no_prefix = true\n  path   = \"secret/passwords\"\n  key {\n    name   = \"username\"\n    format = \"readonly_user_{{ key }}\"\n  }\n  key {\n    name   = \"password\"\n    format = \"custom_prefix_{{ key }}\"\n  }\n  key {\n    name   = \"password\"\n    format = \"legacy_format_password_db\"\n  }\n}\n```\n\n```shell\n$ envconsul \\\n    -config=\"./config.hcl\" \\\n    env\n\nreadonly_user_username=foo\ncustom_prefix_password=bar\nlegacy_format_password_db=bar\n```\n\n\n## Debugging\n\nEnvconsul can print verbose debugging output. To set the log level for\nEnvconsul, use the `-log-level` flag:\n\n```shell\n$ envconsul -log-level info ...\n```\n\n```text\n<timestamp> [INFO] (cli) received redis from Watcher\n<timestamp> [INFO] (cli) invoking Runner\n# ...\n```\n\nYou can also specify the level as debug:\n\n```shell\n$ envconsul -log-level debug ...\n```\n\n```text\n<timestamp> [DEBUG] (cli) creating Runner\n<timestamp> [DEBUG] (cli) creating Consul API client\n<timestamp> [DEBUG] (cli) creating Watcher\n<timestamp> [DEBUG] (cli) looping for data\n<timestamp> [DEBUG] (watcher) starting watch\n<timestamp> [DEBUG] (watcher) all pollers have started, waiting for finish\n<timestamp> [DEBUG] (redis) starting poll\n<timestamp> [DEBUG] (service redis) querying Consul with &{...}\n<timestamp> [DEBUG] (service redis) Consul returned 2 services\n<timestamp> [DEBUG] (redis) writing data to channel\n<timestamp> [DEBUG] (redis) starting poll\n<timestamp> [INFO] (cli) received redis from Watcher\n<timestamp> [INFO] (cli) invoking Runner\n<timestamp> [DEBUG] (service redis) querying Consul with &{...}\n# ...\n```\n\n## Contributing\n\nTo build and install Envconsul locally, you will need to [install Go][go].\n\nClone the repository:\n\n```shell\n$ git clone https://github.com/hashicorp/envconsul.git\n```\n\nTo compile the `envconsul` binary for your local machine:\n\n```shell\n$ make dev\n```\n\nIf you want to run the tests:\n\n```shell\n$ make test\n```\n\nOr to run a specific test in the suite:\n\n```shell\ngo test ./... -run SomeTestFunction_name\n```\n\n[12-factor]: https://12factor.net/\n[envchain]: https://github.com/sorah/envchain\n[envdir]: https://pypi.python.org/pypi/envdir\n[consul]: https://www.consul.io/ \"Service discovery and configuration made easy\"\n[hcl]: https://github.com/hashicorp/hcl \"HashiCorp Configuration Language (HCL)\"\n[go]: https://golang.org \"Go programming language\"\n[releases]: https://releases.hashicorp.com/envconsul/ \"Envconsul releases page\"\n[vault]: https://www.vaultproject.io/ \"A tool for managing secrets\""
}
