{
  "name": "lm-sensors",
  "full_name": "lm-sensors",
  "tap": "homebrew/core",
  "oldname": null,
  "oldnames": [],
  "aliases": [],
  "versioned_formulae": [],
  "desc": "Tools for monitoring the temperatures, voltages, and fans",
  "license": "GPL-2.0-or-later or LGPL-2.1-or-later",
  "homepage": "https://github.com/lm-sensors/lm-sensors",
  "versions": {
    "stable": "3.6.0",
    "head": null,
    "bottle": true
  },
  "urls": {
    "stable": {
      "url": "https://github.com/lm-sensors/lm-sensors/archive/V3-6-0.tar.gz",
      "tag": null,
      "revision": null,
      "checksum": "0591f9fa0339f0d15e75326d0365871c2d4e2ed8aa1ff759b3a55d3734b7d197"
    }
  },
  "revision": 0,
  "version_scheme": 0,
  "bottle": {
    "stable": {
      "rebuild": 0,
      "root_url": "https://ghcr.io/v2/homebrew/core",
      "files": {
        "x86_64_linux": {
          "cellar": "/home/linuxbrew/.linuxbrew/Cellar",
          "url": "https://ghcr.io/v2/homebrew/core/lm-sensors/blobs/sha256:9cab2dd7da319a2eda20dffe27d52292f3e66926fabba8ac1f2204fa0885af3d",
          "sha256": "9cab2dd7da319a2eda20dffe27d52292f3e66926fabba8ac1f2204fa0885af3d"
        }
      }
    }
  },
  "keg_only": false,
  "keg_only_reason": null,
  "options": [],
  "build_dependencies": [
    "bison",
    "flex"
  ],
  "dependencies": [],
  "test_dependencies": [],
  "recommended_dependencies": [],
  "optional_dependencies": [],
  "uses_from_macos": [],
  "uses_from_macos_bounds": [],
  "requirements": [
    {
      "name": "linux",
      "cask": null,
      "download": null,
      "version": null,
      "contexts": [],
      "specs": [
        "stable"
      ]
    }
  ],
  "conflicts_with": [],
  "conflicts_with_reasons": [],
  "link_overwrite": [],
  "caveats": null,
  "installed": [],
  "linked_keg": null,
  "pinned": false,
  "outdated": false,
  "deprecated": false,
  "deprecation_date": null,
  "deprecation_reason": null,
  "disabled": false,
  "disable_date": null,
  "disable_reason": null,
  "post_install_defined": false,
  "service": null,
  "tap_git_head": "4eeae4ea50839e967536ba646d5e0ed6fbcbad7f",
  "ruby_source_path": "Formula/lm-sensors.rb",
  "ruby_source_checksum": {
    "sha256": "66a50486af0218f97a0f1097fa82e19f2be51a529b3f389fa8bfd91e53cadfd3"
  },
  "date_added": "2021-04-28T00:41:16-07:00",
  "readme": "OVERVIEW OF THE LM-SENSORS PACKAGE\n==================================\n\nThe lm-sensors package, version 3, provides user-space support for the\nhardware monitoring drivers in Linux 2.6.5 and later. For older kernel\nversions, you have to use lm-sensors version 2.\n\nThe directories within this package:\n\n* doc\n  Documentation.\n* etc\n  A sample configuration file for libsensors, and a script to convert\n  lm-sensors version 2 configuration files to work with version 3.\n* lib\n  The user-space sensors support library code (libsensors).\n* prog\n  Several supporting programs. The most important ones are:\n  - sensors-detect: A stand-alone program for detecting installed\n    hardware and recommending specific modules to load.\n  - sensors: A console tool to report sensor readings and set new\n    sensor limits.\n  - sensord: A daemon to watch sensor values and log problems. It\n    includes RRD support.\n* configs\n  This directory contains sample configurations of various boards,\n  contributed by users of lm-sensors.\n\n  All configuration files should now be imported from the old\n  www.lm-sensors.org website, however additional information about\n  the origin of the configuration files can be found on the old site:\n  http://web.archive.org/web/20150901092438/http://www.lm-sensors.org:80/wiki/Configurations\n\n  Please contribute back a configuration of your board so other users with\n  the same hardware won't need to recreate it again and again.\n\nINSTALLING LM-SENSORS\n---------------------\n\nSee the INSTALL file.\n\n\nHARDWARE SUPPORT\n----------------\n\nTo find out what hardware you have, just run 'sensors-detect' as root.\n\nMost modern mainboards incorporate some form of hardware monitoring chips.\nThese chips read things like chip temperatures, fan rotation speeds and\nvoltage levels. There are quite a few different chips which can be used by\nmainboard builders for approximately the same results.\n\nLaptops, on the other hand, rarely expose any hardware monitoring\nchip. They often have some BIOS and/or ACPI magic to get the CPU\ntemperature value, but that's about it. For such laptops, the lm-sensors\npackage is of no use (sensors-detect will not find anything), and you have\nto use acpi instead.\n\nThis package doesn't contain chip-specific knowledge. It will support all\nthe hardware monitoring chips your kernel has drivers for. In other words,\nif you find out that you have unsupported hardware (e.g. sensors-detect\ntold you so) then it means that you need a more recent kernel, or you\neven need to wait for a new kernel driver to be written. Updating the\nlm-sensors package itself will not help.\n\n\nLIBSENSORS\n----------\n\nThe kernel drivers communicate their information through the /sys\ninterface. Because every motherboard is different, the drivers always\nadvert the measurements at their pins. This means that the values they\nreport are not always immediately relevant to you. They have to be\nlabelled properly, and sometimes they must be scaled to correspond to\nreal-world values.\n\nlibsensors is a (shared or static) library of access functions. It\noffers a simple-to-use interface for applications to access the sensor\nchip readings and configure them as you like. It has a configuration\nfile where you can put all the motherboard-specific labels and\nconversion rules. That way, all applications do not need to duplicate\nthe effort and can simply link with libsensors and work out of the box.\n\n\nAPPLICATIONS\n------------\n\nThis package contains an example console program that reports all current\nsensors values. This program is called 'sensors'. You can use it as a\nreference implementation for more intricate programs. It also contains a\ndaemon watching for sensor values, logging alarms and feeding an RRD\ndatabase with the sensor measurements.\n\nThis package does not contain a nice graphical monitor. See\nhttp://sensors-applet.sourceforge.net/\nhttps://01.org/powertop/\nhttps://wpitchoune.net/psensor/\nhttps://amanusk.github.io/s-tui/\nfor such programs.\n\n\nTROUBLESHOOTING\n---------------\n\nlm-sensors is blamed for all kinds of problems on a regular basis.\nWhile it is always possible that lm-sensors does in fact have a problem,\nalmost everytime the problem will be elsewhere. The most likely culprit\nfor a problem is one of the kernel drivers prividing data to lm-sensors\nor, rather, the sensors command (and libsensors). If you encounter problems,\nthe following tests are recommended.\n\n- Check enabled sensors with the 'sensors' command. Observe and, if there\n  are errors, write down your test steps and report.\n- If any problems are observed while running the 'sensors' command, disable\n  (unload) kernel drivers one after another. After unloading a driver, run\n  the 'sensors' command again and observe if the error is gone. If it is,\n  you found the problematic driver. Record your tests and report to the driver\n  maintainer.\n- If problems are observed while using libsensors from another application,\n  the same procedure applies (though it is recommended to perform the test\n  with the sensors command first). Again, after identifying the offending\n  driver, record and report your results to the driver maintainer.\n- If this does not help, try to run ptrace on the sensors command and/or\n  the application using libsensors. If you find any anormalies, record\n  your results and report.\n\n\nOTHER INFORMATION\n-----------------\n\nThe lm_sensors website can be found at\nhttps://hwmon.wiki.kernel.org/lm_sensors\n\nThe developers of this package can be reached using\n* a mailing list lm-sensors <at> vger <dot> kernel <dot> org\n  (you can get information on how to subscribe, unsubscribe, and the list\n  of archives at http://vger.kernel.org/vger-lists.html#lm-sensors;\n  you do not need to be subscribed to post to the list)\n* GitHub (see https://github.com/lm-sensors/lm-sensors)\n\nDo not hesitate to contact us if you have questions, suggestions, problems,\nwant to contribute, or just want to report it works for you. But please try to\nread the documentation before you ask any questions! It's all under doc/.\n\nThe latest version of this package can always be found at:\nhttps://github.com/lm-sensors/lm-sensors.\n\nLICENSE\n-------\n\nThe library (libsensors) is released under the GNU Lesser General Public\nLicense (LGPL), as included in the file COPYING.LGPL. The rest of this\npackage may be distributed according to the GNU General Public License\n(GPL), as included in the file COPYING."
}
