{
  "name": "pgdbf",
  "full_name": "pgdbf",
  "tap": "homebrew/core",
  "oldname": null,
  "oldnames": [],
  "aliases": [],
  "versioned_formulae": [],
  "desc": "Converter of XBase/FoxPro tables to PostgreSQL",
  "license": "GPL-3.0",
  "homepage": "https://github.com/kstrauser/pgdbf",
  "versions": {
    "stable": "0.6.2",
    "head": null,
    "bottle": true
  },
  "urls": {
    "stable": {
      "url": "https://downloads.sourceforge.net/project/pgdbf/pgdbf/0.6.2/pgdbf-0.6.2.tar.xz",
      "tag": null,
      "revision": null,
      "checksum": "e46f75e9ac5f500bd12c4542b215ea09f4ebee638d41dcfd642be8e9769aa324"
    }
  },
  "revision": 0,
  "version_scheme": 0,
  "bottle": {
    "stable": {
      "rebuild": 0,
      "root_url": "https://ghcr.io/v2/homebrew/core",
      "files": {
        "arm64_ventura": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/pgdbf/blobs/sha256:c2ecba3b5b9e4803f45f71afbaf66d85333ec329f74513123dbfdc9822b803c6",
          "sha256": "c2ecba3b5b9e4803f45f71afbaf66d85333ec329f74513123dbfdc9822b803c6"
        },
        "arm64_monterey": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/pgdbf/blobs/sha256:2743386480c1d76708d184813b77daadec3bc7a70a542647308c9fb414aa65e3",
          "sha256": "2743386480c1d76708d184813b77daadec3bc7a70a542647308c9fb414aa65e3"
        },
        "arm64_big_sur": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/pgdbf/blobs/sha256:b51760692708d6b3926a405f7b2e83553feeea062a1af91aa0b15858cf9e8b8c",
          "sha256": "b51760692708d6b3926a405f7b2e83553feeea062a1af91aa0b15858cf9e8b8c"
        },
        "ventura": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/pgdbf/blobs/sha256:30721323815b2ff787ea33a99a3a693e126eb4f3222c447a59c8b10d3fa677ba",
          "sha256": "30721323815b2ff787ea33a99a3a693e126eb4f3222c447a59c8b10d3fa677ba"
        },
        "monterey": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/pgdbf/blobs/sha256:6381607bca777a7beb5d475f656a949e580e82b15d1f63fa109764c652da5d9c",
          "sha256": "6381607bca777a7beb5d475f656a949e580e82b15d1f63fa109764c652da5d9c"
        },
        "big_sur": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/pgdbf/blobs/sha256:efd6ad07c77d7c973b9d4bd8e13ea837b43ac281c817f3ce300ac6c46de3f2e4",
          "sha256": "efd6ad07c77d7c973b9d4bd8e13ea837b43ac281c817f3ce300ac6c46de3f2e4"
        },
        "catalina": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/pgdbf/blobs/sha256:ae8050a5d6a6f91f529a0985a5626981d22573094791274c7bc1759b2770c4c7",
          "sha256": "ae8050a5d6a6f91f529a0985a5626981d22573094791274c7bc1759b2770c4c7"
        },
        "mojave": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/pgdbf/blobs/sha256:4a76ca05c6b73ea6fcf57d6699cbaf3e249c5e3b20990e51ab33d11bfbdd7d50",
          "sha256": "4a76ca05c6b73ea6fcf57d6699cbaf3e249c5e3b20990e51ab33d11bfbdd7d50"
        },
        "high_sierra": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/pgdbf/blobs/sha256:caf544eee09339bb34ab68a35880bc863bb13aa7943de98ef25680cb0182f901",
          "sha256": "caf544eee09339bb34ab68a35880bc863bb13aa7943de98ef25680cb0182f901"
        },
        "sierra": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/pgdbf/blobs/sha256:7d0eabf3051e9cf450d985987f89cf0d70476b37202b3b5bdc84ec48e8cb670d",
          "sha256": "7d0eabf3051e9cf450d985987f89cf0d70476b37202b3b5bdc84ec48e8cb670d"
        },
        "el_capitan": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/pgdbf/blobs/sha256:72ad6b801d25db2008d0ab4badd2bb280f55eb6f6956925ee5620d62d8f06bbb",
          "sha256": "72ad6b801d25db2008d0ab4badd2bb280f55eb6f6956925ee5620d62d8f06bbb"
        },
        "x86_64_linux": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/pgdbf/blobs/sha256:7f2e231fc1b78b7837dfe257a04e2495128237e5800609675573dd2734185ea5",
          "sha256": "7f2e231fc1b78b7837dfe257a04e2495128237e5800609675573dd2734185ea5"
        }
      }
    }
  },
  "keg_only": false,
  "keg_only_reason": null,
  "options": [],
  "build_dependencies": [],
  "dependencies": [],
  "test_dependencies": [],
  "recommended_dependencies": [],
  "optional_dependencies": [],
  "uses_from_macos": [],
  "uses_from_macos_bounds": [],
  "requirements": [],
  "conflicts_with": [],
  "conflicts_with_reasons": [],
  "link_overwrite": [],
  "caveats": null,
  "installed": [],
  "linked_keg": null,
  "pinned": false,
  "outdated": false,
  "deprecated": false,
  "deprecation_date": null,
  "deprecation_reason": null,
  "disabled": false,
  "disable_date": null,
  "disable_reason": null,
  "post_install_defined": false,
  "service": null,
  "tap_git_head": "4eeae4ea50839e967536ba646d5e0ed6fbcbad7f",
  "ruby_source_path": "Formula/pgdbf.rb",
  "ruby_source_checksum": {
    "sha256": "6ff49f7187279b6fc93bd8dff384e0ce5f1c53dab3a06abcb7449d14c1859a00"
  },
  "date_added": "2012-03-12T20:45:54-07:00",
  "readme": "PgDBF is a program for converting XBase databases - particularly FoxPro tables with memo files - into a format that PostgreSQL can directly import.  It's a compact C project with no dependencies other than standard Unix libraries.  While the project is relatively tiny and simple, it's also heavily optimized via profiling - routine benchmark were many times faster than with other Open Source programs.  In fact, even on slower systems, conversions are typically limited by hard drive speed.\n\n# Features\nPgDBF was designed with a few core principles:\n\n* Simplicity.  This code should be understandable by anyone who wants to hack it.\n* Robustness.  Every syscall is checked for success.\n* Speed.  PgDBF was born to be the fastest conversion available anywhere.\n* Completeness.  It has full support for FoxPro memo files.\n* Portability.  PgDBF runs on 32- and 64-bit systems, and both little-endian (eg x86) and big-endian (eg PowerPC) architectures.\n\n# Performance\n\nPgDBF's speed is generally limited by how fast it can read your hard drives.  A striped RAID of quick disks can keep PgDBF pretty well fed on a single-processor system.  One problem area is with memo files, which may become very internally fragmented as memo fields are created, deleted, and updated.  For best results, consider placing the DBF and FPT files on a RAM drive so that there's no seek penalty as there is with spinning hard drives, or using a filesystem such as ZFS that caches aggressively.\n\nOne particularly fragmented 160MB table with memo fields used to take over three minutes on a FreeBSD UFS2 filesystem.  Moving the files to a RAM disk dropped the conversion time to around 1.2 seconds.\n\nA certain test table used during development comprises a 280MB DBF file and a 660MB memo file. PgDBF converts this to a 1.3 million row PostgreSQL table in about 11 seconds, or at a rate of almost 120,000 rows per second.\n\n# Downloading\n\nDownloadable tarballs of numbered releases are available at [the SourceForge download page](http://sourceforge.net/project/showfiles.php?group_id=257285). Development happens on GitHub at [https://github.com/kstrauser/pgdbf](https://github.com/kstrauser/pgdbf).\n\n# Release Notes\n\nVersion 0.6.3 (January 21, 2018) adds the autoindex (autoincrement) field identifier 0x31 and 0x32, and outputs \"V\" fields as varchar. Handles wide varchars. Can ignore fields with \"-i\". Can disable automatic removal of field padding. Correct column time for currencies. Format FLOAT fields like NUMERIC.\n\nVersion 0.6.2 (September 30, 2012) adds built-in iconv translation from the given encoding to UTF-8. Thanks to Philipp Wollermann, PgDBF's new co-author/co-maintainer, for the heavy lifting!\n\nVersion 0.6.1 (March 1, 2012) is exactly identical in operation to 0.6.0, but I'm an awful release engineer and always forget to update the version number in the man page, etc. This bumps the revision to indicate that files have changed.\n\nVersion 0.6.0 (February 29, 2012) breaks compatibility with older versions by creating NUMERIC fields as type NUMERIC instead of TEXT by default. Use the \"-N\" flag to get the old behavior. Use the new(ish) PRId64 definition from inttypes.h to print 64-bit CURRENCY fields. Adds an optional progress bar. Adds 64-bit file offset support for Linux (and possibly Solaris, although it's not tested). Increased the default buffer and batch sizes from 1MB and 128KB to 4MB and 16MB respectively. Cleaned up lots of endian-handling code.\n\nVersion 0.5.5 (February 3, 2011) adds the \"-q\" option to place quotation marks around the name of the table when using it in statements like \"CREATE TABLE\", \"DROP TABLE\", etc.\n\nVersion 0.5.4 (November 16, 2010) does away with the single memofile size check at the beginning of the run and checks for valid memo record offsets every time one is requested.\n\nVersion 0.5.3 (November 15, 2010) fixes an unsigned int comparison bug.\n\nVersion 0.5.2 (November 3, 2010) adds tests for the validity of specified memofiles. Older versions would possibly segfault if an invalid memofile was given.\n\nVersion 0.5.1 (March 9, 2010) enables the \"IF EXISTS\" (the \"-e\" option) to \"DROP TABLE\" by default.  If you are using PgDBF with a version of PostgreSQL older than 8.2 (which was released in December 2006), you will need to use the \"-E\" flag to disable it.  Also adds \"-u\" and \"-U\" flags to control whether a \"TRUNCATE TABLE\" statement is issued to clear the table before copying data.\n\nVersion 0.5.0 (November 24, 2009) is not a drop-in replacement for older versions.  Specifically:\n\n\n    * It no longer tries to guess the names of memofiles.  If a table has a memofile, it must be specified with the \"-m\" command line argument.\n    * The \"N\" (numeric) and \"F\" (float) datatypes now emit \\N (NULL) instead of empty strings.\n  \n# Building and Installation\n\n```shell\n./configure; make; make install\n```\n\n# Usage\n\nUse PgDBF to convert your XBase tables into a format suitable for piping into the psql client.  PgDBF will generate the commands necessary to create near-exact replicas of your tables. Its output looks something like: \n\n```sql\nBEGIN;\nSET statement_timeout=60000; DROP TABLE IF EXISTS invoice; SET statement_timeout=0;\nCREATE TABLE invoice (invoiceid INTEGER, note VARCHAR(50), billdate DATE, submitted TIMESTAMP, memofield TEXT, approved BOOLEAN);\n\\COPY invoice FROM STDIN\n...\n...\n...\n\\.\nCOMMIT;\nCREATE INDEX invoice_invoiceid ON invoice(invoiceid);\n```\n\nNote that the entire process is usually wrapped inside a transaction so that other clients will have access to the old data until the transaction is completed. \n\n\n## Command Line\n\n```\nUsage: pgdbf [-cCdDeEhnNpPqQtTuU] [-s encoding] [-m memofilename] [-i fieldname1,fieldname2,fieldnameN] filename [indexcolumn ...]\n```\n\nThe only required argument is the filename of the table to be converted.  If the table has a memo field, then use the \"-m\" option to specify the path to the memo file.\n\nThe \"-h\" flag prints this usage information and then exits.\n\nThe \"-c\" flag cause PgDBF to print a \"CREATE TABLE\" statement to make a table with similar datatypes and column names as the DBF file.  This is the default behavior.\n\nThe \"-C\" suppresses the \"CREATE TABLE\" statement.\n\nThe \"-d\" flag causes PgDBF to print a \"DROP TABLE\" statement before the \"CREATE TABLE\" command.  This is useful for replacing the contents of a table that already exists in PostgreSQL.  This is the default behavior.  If \"-C\" was used to disable the \"CREATE TABLE\" statement, then \"-d\" will be silently ignored (as it makes no sense to drop a table and then try to insert into it).\n\nThe \"-D\" flag causes PgDBF *not* to print the \"DROP TABLE\" statement.\n\nThe \"-e\" flag changes the \"DROP TABLE\" statement to \"DROP TABLE IF EXISTS\".  PostgreSQL will return an error when attempting to drop a table that does not exist.  Version 8.2 and newer can use the \"IF EXISTS\" modifier to drop the table only if it's already defined, and otherwise continue without error. This is the default.\n\nThe \"-E\" flag disables the \"IF EXISTS\" modifier to \"DROP TABLE\" for compatibility with old versions of PostgreSQL.\n\nThe \"-i\" flag gives a comma-separated list of field names to remove from the output.\n\nUse the \"-m\" argument to specify the memofile (if any) associated with the table.\n\nThe \"‐n\" flag creates NUMERIC fields with type NUMERIC. **This is a new default and different from old versions of PgDBF!**\n\nThe \"‐N\" flag creates NUMERIC fields with type TEXT. This is the historical default setting. Use this if rows contain invalid number data in NUMERIC fields, which  are  essentially CHARACTER fields behind the scenes, and you receive errors when importing the data into PostgreSQL.\n\nThe \"‐p\" argument shows a progress bar during the conversion process.\n\nThe default \"-P\" argument hides the progress bar.\n\nThe \"‐q\" flag encloses the name of the table in quotation marks in statements like \"CREATE TABLE\", \"DROP TABLE\", and so on. This is useful  in cases  where  the  table name is a PostgreSQL reserved word, and almost certainly harmless in all other cases.\n\nThe \"‐Q\" flag doesn't enclose  the  name  of  the  table  in  quotation  marks. This is the default.\n\nThe \"-s\" flag uses iconv to convert from the named encoding to UTF-8. This is useful for importing databases originally encoded in non-ASCII charsets without losing the non-ASCII data.\n\nThe \"-t\" flag wraps the entire script in a transaction.  Since transaction commits are atomic, there will never be an instant in time where the table appears empty to other clients.  Instead, the old table data will seem to be instantaneously replaced with the new contents.  This is the default.\n\nThe \"-T\" flag removes the wrapper transaction.  This is generally not a good idea as it causes the table to be completely empty at times.\n\nThe \"-u\" flag generates a \"TRUNCATE TABLE\" statement to quickly empty a table without dropping and re-creating it.\n\n\"-U\" disables the \"TRUNCATE TABLE\" statement.  This is the default.\n\nIndices are automatically created if you specify the columns (or expressions!) you want indexed on the command line. For example, \n\n```shell\npgdbf foo.dbf rowid \"substr(textfield,1,4)\" price\n```\n\nwill create three indices on the new foo table: one each for the rowid and price columns, and one for the substr() expression. It tries to give each index a reasonable name.\n\n# Note about character encodings\n\nOlder versions of PostgreSQL defaulted to the SQL_ASCII character encoding which accepted pretty much any string of bytes you could throw at it. Newer versions of PostgreSQL default to using UTF-8 encoding. PgDBF outputs data exactly as it's stored in the XBase tables, and this can result in dumps that PostgreSQL can't directly import.\n\nPgDBF's \"-s\" flag can handle this for you by using `libiconv` to convert an XBase table's output to UTF-8. If you're not sure which encoding your table uses, consider using the `chardet` or `uchardet` program to examine PgDBF's output and suggest the most likely encoding.\n\nSometimes this is insufficient, usually because the input table files contain corrupted data. In this case, if you can afford to lose the corrupted bytes, the separate `iconv` command can be used like so:\n\n```shell\npgdbf table.dbf | iconv -c -f UTF-8 -t UTF-8 | psql targetdatabase\n```\n\nNote that this will *discard* data that can't be stored in UTF-8.\n\n# Bugs\n\nWhen multiple incompatible interpretations of a type are available, such as the 'B' type which can mean 'binary object' in dBASE V or 'double-precision float' in FoxPro, I've used the FoxPro version.\n\nNot all XBase datatypes are supported right now.  As of this writing, PgDBF can handle boolean, currency, date, double-precision float, float, general (although only outputs empty strings; it's unclear how to resolve OLE objects at this time), integer, memo, numeric, timestamp, and varchar fields.  If you need other datatypes, send a small sample database for testing.\n\n# Contributors\n\nPgDBF was originally written by [Kirk Strauser](kirk@strauser.com\">kirk@strauser.com) and approved for release under the GPLv3 by the owner of his company, Brandon Day. Philipp Wollermann joined the team leading up to the release of version 0.6.2.\n\nSpecial thanks to the following for suggestions and bug reports:\n\n* John Easton\n* Stephan Kasdorf\n* Alan Polinsky\n* Fabrízio de Royes Mello\n* Gordon Sweet\n\n# Support\n\nThe mailing list home page is at https://groups.google.com/d/forum/pgdbf"
}
