{
  "name": "stout",
  "full_name": "stout",
  "tap": "homebrew/core",
  "oldname": null,
  "oldnames": [],
  "aliases": [],
  "versioned_formulae": [],
  "desc": "Reliable static website deploy tool",
  "license": "MIT",
  "homepage": "https://github.com/cloudflare/Stout",
  "versions": {
    "stable": "1.3.2",
    "head": null,
    "bottle": true
  },
  "urls": {
    "stable": {
      "url": "https://github.com/cloudflare/Stout/archive/v1.3.2.tar.gz",
      "tag": null,
      "revision": null,
      "checksum": "33aa533beda7181d5efdcfb9fadcc568f58c1f7e27a4902adf1a6807c4875c99"
    }
  },
  "revision": 0,
  "version_scheme": 0,
  "bottle": {
    "stable": {
      "rebuild": 0,
      "root_url": "https://ghcr.io/v2/homebrew/core",
      "files": {
        "arm64_monterey": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/stout/blobs/sha256:dd10a1085d7eeda1f1fb49febcd1216dd4fab9c07d2a1daf20a283409a609fc5",
          "sha256": "dd10a1085d7eeda1f1fb49febcd1216dd4fab9c07d2a1daf20a283409a609fc5"
        },
        "arm64_big_sur": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/stout/blobs/sha256:8a8daaa0e22c67dd5988d21cbad74601d3c6bfe2320cabc4236d7ed4444befd2",
          "sha256": "8a8daaa0e22c67dd5988d21cbad74601d3c6bfe2320cabc4236d7ed4444befd2"
        },
        "monterey": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/stout/blobs/sha256:c77888fdfabc4068d4f876bea213605188f2892210a10caf5126bb4f234c8e7e",
          "sha256": "c77888fdfabc4068d4f876bea213605188f2892210a10caf5126bb4f234c8e7e"
        },
        "big_sur": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/stout/blobs/sha256:4f91bfefe5af79d0d5ff602956834ec6b20ff8fa55c1152ec37086a2129389c1",
          "sha256": "4f91bfefe5af79d0d5ff602956834ec6b20ff8fa55c1152ec37086a2129389c1"
        },
        "catalina": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/stout/blobs/sha256:95406589caa2074808e99e54b755c2ea7b73fdd3ac8528c1a7f124895f3c1be5",
          "sha256": "95406589caa2074808e99e54b755c2ea7b73fdd3ac8528c1a7f124895f3c1be5"
        },
        "mojave": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/stout/blobs/sha256:7d90dec0fbc23cfc58b56261957818a0fb1af5c77086b1979b77ea1196484a25",
          "sha256": "7d90dec0fbc23cfc58b56261957818a0fb1af5c77086b1979b77ea1196484a25"
        },
        "high_sierra": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/stout/blobs/sha256:cfff658fcb5319cd6a5053c645a9679d3db94e9dff4fbe91ae488ca31658a1fc",
          "sha256": "cfff658fcb5319cd6a5053c645a9679d3db94e9dff4fbe91ae488ca31658a1fc"
        },
        "sierra": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/stout/blobs/sha256:26554af96b6044316abecb1a2142e81b1aab8315bff941cbdad9b39fe143b74e",
          "sha256": "26554af96b6044316abecb1a2142e81b1aab8315bff941cbdad9b39fe143b74e"
        },
        "x86_64_linux": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/stout/blobs/sha256:15db742d981663afb91ae74d337c992c4db3fce07fb5220e2c70ffda68cf6da9",
          "sha256": "15db742d981663afb91ae74d337c992c4db3fce07fb5220e2c70ffda68cf6da9"
        }
      }
    }
  },
  "keg_only": false,
  "keg_only_reason": null,
  "options": [],
  "build_dependencies": [
    "go"
  ],
  "dependencies": [],
  "test_dependencies": [],
  "recommended_dependencies": [],
  "optional_dependencies": [],
  "uses_from_macos": [],
  "uses_from_macos_bounds": [],
  "requirements": [],
  "conflicts_with": [],
  "conflicts_with_reasons": [],
  "link_overwrite": [],
  "caveats": null,
  "installed": [],
  "linked_keg": null,
  "pinned": false,
  "outdated": false,
  "deprecated": false,
  "deprecation_date": null,
  "deprecation_reason": null,
  "disabled": true,
  "disable_date": "2022-07-31",
  "disable_reason": "unmaintained",
  "post_install_defined": false,
  "service": null,
  "tap_git_head": "4eeae4ea50839e967536ba646d5e0ed6fbcbad7f",
  "ruby_source_path": "Formula/stout.rb",
  "ruby_source_checksum": {
    "sha256": "453a5b126c1b95e3b2805182d47dfcef9de13ff8b5551bb2c2de065d54ccba55"
  },
  "date_added": "2016-07-10T13:05:13+01:00",
  "readme": "# Stout\n\n#### [View the site →](http://stout.is/)\n\nStout is a deploy tool for static websites.  It takes a website and uploads it to S3 in a more reliable way than other tools.  It can be an alternative\nto paid services like Divshot, to dynamic web servers like Rails, or to manually uploading your site to S3 or an FTP server.\n\n## Why You Need Stout\n\nTraditionally uploading your files to S3 introduces a serious caching issue we ran into in practice at [Eager](https://eager.io).\nThe cache for the various files your site depends on can expire at different times, meaning your users get an inconsistent (broken) set of files for a\ntime after every single deploy. Further, traditional static site deployments don't offer any method of rolling back a previous deploy.\n\nWe built Stout to fix these issues.\n\n### Features\n\n- Versions script and style files to ensure your pages don't use an inconsistent set of files during or after a deploy\n- Supports rollback to any previous version\n- Does not depend on any specific build tool or workflow (it is a standalone executable written in Go)\n- Does not require a datastore of any kind to maintain state or history\n- Can be used by multiple developers simultaneously without locking or a danger of inconsistent state\n- Properly handles caching headers\n- Supports deploying multiple projects to various subdirectories of the same site without conflicts\n- Compresses files for faster delivery\n\n### Limitations\n\n- Stout doesn't currently support rolling back files that aren't HTML, JS or CSS (images, videos, etc.).  See the Versioning section for more information.\n- All-or-nothing consistency is only guarenteed on a per-html-file basis, not for the entire deploy.  See the Consistency section for more information.\n\n## Getting Started\n\n[Download](https://github.com/EagerIO/Stout/releases) the `stout` executable for your system from our latest release into a directory on your `$PATH`, like `/usr/local/bin`.\n\nYou can use the `create` command to create a new site.  It automatically creates an S3 bucket, a CloudFront distribution, and a user account for deployment.  It therefore requires\ncredentials for an Amazon AWS account which has permissions to those services along with Route 53.\n\n```sh\nstout create --bucket my.website.com --key MY_AWS_KEY --secret MY_AWS_SECRET\n```\n\nYou can then deploy your project:\n\n```sh\nstout deploy --bucket my.website.com --key MY_AWS_KEY --secret MY_AWS_SECRET\n```\n\nIf your built files are in another directory, add the `--root` option:\n\n```sh\nstout deploy --bucket my.website.com --key MY_AWS_KEY --secret MY_AWS_SECRET --root ./build\n```\n\nIf your bucket located not in the default region, which is us-east-1, add the `--region` option:\n\n```sh\nstout deploy --bucket my.website.com --key MY_AWS_KEY --secret MY_AWS_SECRET --region us-west-1\n```\n\nIf you don't want to deploy all the files in your folder, use the files argument.\n\n```sh\nstout deploy --bucket my.website.com --key MY_AWS_KEY --secret MY_AWS_SECRET --root ./build --files \"*.html,images/*\"\n```\n\nJavascript and CSS included in your HTML files will always be included automatically.\n\nThe deploy command will give you a deploy id you can use in the future to rollback if you have to:\n\n```sh\nstout rollback --bucket my.website.com --key MY_AWS_KEY --secret MY_AWS_SECRET a3b8ff290c33\n```\n\nEventually you'll probably want to move your config to a deploy.yaml file, rather than specifying it in the command every time.\n\nUsing the info below you can learn about what the deploy/rollback tools actually do, deploying to subfolders, deploying from your build tool, and rolling back.\n\n## Backstory\n\nWe wrote Stout because we couldn't find an open-source way to reliably and efficiently deploy our static sites (including our app and blog).  We used a traditional upload-to-s3 tool, but caching meant a user could get the new html and styles, but the old scripts, for example, causing sporatic and random errors.  It also didn't support reliably rolling back when necessary.  We built Stout to be the reliable, production-ready choice for static deploys.\n\n## Function\n\nStout is an executable file built from Go code.  The `deploy` command deploys one or more html files and their dependencies to a specified location in S3.  The `rollback` command takes a deploy id and rolls the project back to that version.\n\n### Deploy\n\nThe deploy process works by parsing the script and style tags out of one or more html files.  It then hashes those files, uploads them prefixed with their hashes, and updates the location of the original script and link tags with the hashed locations.\n\nIt generates a deploy id by hashing all of the files in the deploy, and uploads the html files to a location prefixed by the deploy id.\n\nWhen the uploads are successful, the prefixed html files are atomically copied to their unprefixed paths, completing the deploy.\n\n### Rollback\n\nA rollback simply copies the html files prefixed with the specified deploy id to the unprefixed paths.\n\n### Deploy Configuration\n\nYou can configure the deploy tool with any combination of command line flags or arguments provided in a configuration yaml file.\n\nThe options are:\n\n##### `bucket`\n  The S3 bucket to deploy to.  In most configurations this bucket should be the origin for the CDN which actually serves your site.  It usually makes sense to make this the url you are going to host your site from (i.e. `\"example.com\"`)\n  \t\n##### `config` (\"./deploy.yaml\")\n  The location of a yaml file to read any otherwise unspecified configuration from.\n   \n##### `dest` (\"./\")\n  The destination directory to write files to in the S3 bucket.   For example if you wanted your this project to end up hosted at `yoursite.com/blog`, you would specify `--dest blog`.\n  \t\n##### `root` (\"./\")\n The local directory where the files to be uploaded lives.  It's common to make this your \"./build\" directory or the like.\n \n##### `files` (\"*\")\n  Comma-seperated glob patterns of the files to be deployed (within the `--root`).  HTML files will be parsed, and the CSS/JS they point to will be included (versioned) automatically.  If you also include those files in your glob pattern they will be uploaded twice, once with a versioning hash in the URL, again without.\n  \n  Be sure to include any additional files you would like deployed like images, videos, font files, etc.\n\n  You can use relative paths which break out of the `root`.  If you prefix the path with `-/`, it will be interpreted as relative to the project directory, not the `root`.\n  \t\n##### `env`\n  The config file can contain configurations for multiple environments (production, staging, etc.).  This specifies which is used.  See the \"YAML Config\" section for more information.\n\n##### `key`\n  The AWS key to use.  The create command will create an IAM user for each project with access only to the relevant bucket.  See the Permissions section for more information.\n  \n##### `secret`\n  The AWS secret of the provided key.\n\n##### `region` (\"us-east-1\")\n  The AWS region the S3 bucket is located in. \n  \n  If you are getting a `The bucket you are attempting to access must be addressed using the specified endpoint. Please send all future requests to this endpoint.` error, specify your bucket `--region`.\n   \n### YAML Config\n\nYou can provide a yaml file which specifies configuration defaults for the project being deployed.  We include this file in each project which will be deployed.  This file can have multiple configurations for different environments, along with a default section.\n\nFor example, the `deploy.yaml` for one of our projects looks like:\n\n```yaml\ndefault:\n  root: 'build/'\n\nproduction:\n  key: 'XXX'\n  secret: 'XXX'\n  bucket: 'eager.io'\n\ndevelopment:\n  key: 'XXX'\n  secret: 'XXX'\n  bucket: 'next.eager.io'\n```\n\nReplacing the \"XXX\"s with our actual credentials.\n\nTo deploy to development we run (from the directory with the deploy.yaml file in it):\n\n```bash\ndeploy --env development\n```\n\nA rollback of development would be:\n\n```bash\nrollback --env development $DEPLOY_ID\n```\n\nWhere the deploy id is taken from the output of the deploy you wish to rollback to.\n \nOur public projects use a similar config, but they specify the Amazon credentials as environment vars from the build system, passed in as flags:\n \n ```bash\ndeploy --env development --key $AMAZON_KEY_DEV --secret $AMAZON_SECRET_DEV\n```\n\nNever commit Amazon credentials to a file in a public repo.  Keep them on your local machine, or in your build system's configuration.\n\n### Clean URLS\n\nIt's not specific to Stout, but it's worth mentioning that we recommend you structure your built folder to use a folder with an index.html file for each page.\n\nFor example, if you want a root and a page at `/blog`, you would have:\n\n```\nindex.html\nblog/\n  index.html\n```\n\nThat way, assuming S3 and CloudFront are configured properly, you'll be able to use the clean URLs `/` and `/blog/`.\n\n### SSL\n\nCloudfront has the ability to serve your site using SSL.  The general procedure for setting it up is:\n\n1. Get an SSL certificate for your domain\n2. Upload it to Amazon\n3. Select that certificate in the configuration for the CloudFront distribution Stout creates for you\n\nYou will absolutely need more detailed instructions, which you can find [here](https://bryce.fisher-fleig.org/blog/setting-up-ssl-on-aws-cloudfront-and-s3/).\n\nSelecting a certificate for you is one of the few things the `create` command does not do, as it's not always possible to decide which certificate is appropriate.  If you need SSL support, you will have to remember to select the cert in the Amazon Console or CLI after running the `create` command.\n\n### Permissions\n\nThe AWS user which is used for Stout should have the `GetObject`, `PutObject`, `DeleteObject`, and `ListBucket` permissions.  The `create` command will set this up for you if you use it.\n\nThis is an example policy config which works:\n\n```json\n{\n  \"Version\": \"2012-10-17\",\n  \"Statement\": [\n    {\n      \"Effect\": \"Allow\",\n      \"Action\": [\n        \"s3:DeleteObject\",\n        \"s3:ListBucket\",\n        \"s3:PutObject\",\n        \"s3:PutObjectAcl\",\n        \"s3:GetObject\"\n      ],\n      \"Resource\": [\n        \"arn:aws:s3:::BUCKET\", \"arn:aws:s3:::BUCKET/*\"\n      ]\n    }\n  ]\n}\n```\n\nBe sure to replace `BUCKET` with your bucket's actual name.\n\n### Deploying with CircleCI\n \n Deploying with CircleCI is simply a matter of installing the deploy tool and running it as you would locally.  Here's an excerpt of a working circle.yml:\n \n ```yaml\ndependencies:\n  post:\n    - go get github.com/tools/godep\n    - git clone git@github.com:EagerIO/Stout.git\n    - cd Stout; godep go build -o ../stout src/*.go\n    \ndeployment:\n  development:\n    branch: dev\n    commands:\n      - ./stout deploy --env development --key $AMAZON_KEY_DEV --secret $AMAZON_SECRET_DEV\n\n  production:\n    branch: master\n    commands:\n      - ./stout deploy --env production --key $AMAZON_KEY_PROD --secret $AMAZON_SECRET_PROD\n ```\n \nIf you use environment vars for your credentials, make sure to add them to your Circle config.\n \nIf your repo is private, you can specify your Amazon key and secret in your deploy.yaml file, removing the need to specify them in the commands.\n \n### Caching\n\nAll versioned files (include a hash of their contents in the path) are configured to cache for one year.  All unversioned files are configured to cache for 60 seconds.  This means it will take up to 60 seconds for users to see changes made to your site.\n\n### Versioning\n\nOnly JS and CSS files which are pointed to in HTML files are hashed, as we need to be able to update the HTML to point to our new, versioned, files.\n\nAny other file included in your `--files` argument will be uploaded, but not versioned, meaning a rollback will not effect these files.  This is something we'd like to improve. \n \n### Consistency\n\nAs the final step of the deploy is atomic, multiple actors can trigger deploys simultaneously without any danger of inconsistent state.  Whichever process triggers the final 'copy' step for a given file will win, with it's specified dependencies guarenteed to be used in their entirity.  Note that this consistency is only guarenteed on a per-html-file level, you may end up with some html files from one deployer, and others from another, but all files will point to their correct dependencies.\n\n### Deploying Multiple Projects To One Site\n\nYou can deploy multiple projects to the same domain simply by specifying the appropriate `dest` for each one.  For example your homepage might have the dest `./`, and your blog `./blog`.  Your homepage will be hosted at `your-site.com`, your blog `your-site.com/blog`.\n\n### Using Client-side Routers\n\nIt is possible to use a client-side router (where you have multiple request URLs point to the same HTML file) by configuring your CloudFront distribution to serve your index.html file in response to 403s and 404s.\n\n![CF](https://raw.githubusercontent.com/EagerIO/Stout/master/docs/images/cf-screenshot.png)\n\n### Installing\n\n- Download the release for your system type from our [releases](https://github.com/EagerIO/Stout/releases)\n- Copy or symlink the `stout` binary contained in the archive into your path (for example, into `/usr/local/bin`)\n\n### Building\n\n- Install go and godep\n- Run `godep restore ./...`\n- Run `go build -o ../stout src/*`\n\n#### For a Release (Cross Compiling)\n\n- Run `go get github.com/laher/goxc`\n- Run `go get code.google.com/p/go.tools/cmd/vet`\n- Run `./utils/xc.sh`\n\nThe first run will take significantly longer than future runs.  The built files will be placed in the `./builds` directory.\n\n### Running\n\nTo run the commands for development purposes, run: `go run src/*`, followed by any command line args you would normally give to the command.\n\n### Contributing\n\nPlease do, we would love for this to become a project of the community.  Feel free to open an issue, submit a PR or contribute to the wiki."
}
