{
  "name": "zsh-async",
  "full_name": "zsh-async",
  "tap": "homebrew/core",
  "oldname": null,
  "oldnames": [],
  "aliases": [],
  "versioned_formulae": [],
  "desc": "Perform tasks asynchronously without external tools",
  "license": "MIT",
  "homepage": "https://github.com/mafredri/zsh-async",
  "versions": {
    "stable": "1.8.6",
    "head": null,
    "bottle": true
  },
  "urls": {
    "stable": {
      "url": "https://github.com/mafredri/zsh-async/archive/v1.8.6.tar.gz",
      "tag": null,
      "revision": null,
      "checksum": "0f2778cb882b73471569b016bbfa6d9d75572bff40dc7f25ac50b3a8dc94ef47"
    }
  },
  "revision": 0,
  "version_scheme": 0,
  "bottle": {
    "stable": {
      "rebuild": 0,
      "root_url": "https://ghcr.io/v2/homebrew/core",
      "files": {
        "all": {
          "cellar": ":any_skip_relocation",
          "url": "https://ghcr.io/v2/homebrew/core/zsh-async/blobs/sha256:70f99dea8c8e873996507d7e7be083fa5ef70cc2f33e92d131c4cc0dacda4a0c",
          "sha256": "70f99dea8c8e873996507d7e7be083fa5ef70cc2f33e92d131c4cc0dacda4a0c"
        }
      }
    }
  },
  "keg_only": false,
  "keg_only_reason": null,
  "options": [],
  "build_dependencies": [],
  "dependencies": [],
  "test_dependencies": [],
  "recommended_dependencies": [],
  "optional_dependencies": [],
  "uses_from_macos": [
    "zsh"
  ],
  "uses_from_macos_bounds": [
    {}
  ],
  "requirements": [],
  "conflicts_with": [],
  "conflicts_with_reasons": [],
  "link_overwrite": [],
  "caveats": null,
  "installed": [],
  "linked_keg": null,
  "pinned": false,
  "outdated": false,
  "deprecated": false,
  "deprecation_date": null,
  "deprecation_reason": null,
  "disabled": false,
  "disable_date": null,
  "disable_reason": null,
  "post_install_defined": false,
  "service": null,
  "tap_git_head": "aa66a84309b297ea296f7a4b9c424b5c0ec4875c",
  "ruby_source_path": "Formula/zsh-async.rb",
  "ruby_source_checksum": {
    "sha256": "32f3484fdbbea1fbe9cbaefa23e112e3a9db82b8fded9dabf07ba34d2e152364"
  },
  "date_added": "2020-12-19T13:10:49+00:00",
  "readme": "# zsh-async\n\n![Test](https://github.com/mafredri/zsh-async/workflows/Test/badge.svg)\n\n```\nBecause your terminal should be able to perform tasks asynchronously without external tools!\n```\n\n## Intro (TL;DR)\n\nWith `zsh-async` you can run multiple asynchronous jobs, enforce unique jobs (multiple instances of the same job will not run), flush all currently running jobs and create multiple workers (each with their own jobs). For each worker you can register a callback-function through which you will be notified about the job results (job name, return code, output and execution time).\n\n## Overview\n\n`zsh-async` is a small library for running asynchronous tasks in zsh without requiring any external tools. It utilizes `zsh/zpty` to launch a pseudo-terminal in which all commands get executed without blocking any other processes. Checking for completed tasks can be done manually, by polling, or better yet, automatically whenever a process has finished executing by notifying through a `SIGWINCH` kill-signal.\n\nThis library bridges the gap between spawning child processes and disowning them. Child processes launched by normal means clutter the terminal with output about their state, and disowned processes become separate entities, no longer under control of the parent. Now you can have both!\n\n## Usage\n\nThe async worker is a separate environment (think web worker). You send it a job (command + parameters) to execute and it returns the result of that execution through a callback function. If you find that you need to stop/start a worker to update global state (variables) you should consider refactoring so that state is passed during the `async_job` call (e.g. `async_job my_worker my_function $state1 $state2`).\n\nNote that because the worker is a separate forked environment, any functions you want to use as jobs in the worker need to be defined before the worker is started, otherwise you will get a `command not found` error when you try to launch the job.\n\n### Installation\n\n#### Manual\n\nYou can either source the `async.zsh` script directly or insert under your `$fpath` as async and autoload it through `autoload -Uz async && async`.\n\n#### Integration\n\n##### zplug\n\n```\nzplug \"mafredri/zsh-async\", from:\"github\", use:\"async.zsh\"\n```\n\n### Functions\n\nThe `zsh-async` library has a bunch of functions that need to be used to perform async actions:\n\n#### `async_init`\n\nInitializes the async library (not required if using async from `$fpath` with autoload.)\n\n#### `async_start_worker <worker_name> [-u] [-n] [-p <pid>]`\n\nStart a new async worker with optional parameters, a worker can be told to only run unique tasks and to notify a process when tasks are complete.\n\n* `-u` unique. Only unique job names can run, e.g. the command `git status` will have `git` as the unique job name identifier\n\n* `-n` notify through `SIGWINCH` signal. Needs to be caught with a `trap '' WINCH` in the process defined by `-p`\n\n  **NOTE:** When `zsh-async` is used in an interactive shell with ZLE enabled this option is not needed. Signaling through `SIGWINCH` has been replaced by a ZLE watcher that is triggered on output from the `zpty` instance (still requires a callback function through `async_register_callback` though). Technically zsh versions prior to `5.2` do not return the file descriptor for zpty instances, however, `zsh-async` attempts to deduce it anyway.\n\n* `-p` pid to notify (defaults to current pid)\n\n#### `async_stop_worker <worker_name_1> [<worker_name_2>]`\n\nSimply stops a worker and all active jobs will be terminated immediately.\n\n#### `async_job <worker_name> <my_function> [<function_params>]`\n\nStart a new asynchronous job on specified worker, assumes the worker is running. Note if you are using a function for the job, it must have been defined before the worker was started or you will get a `command not found` error.\n\n#### `async_worker_eval <worker_name> <my_function> [<function_params>]`\n\nEvaluate a command (like async_job) inside the async worker, then worker environment can be manipulated. For example, issuing a cd command will change the PWD of the worker which will then be inherited by all future async jobs.\n\nOutput will be returned via callback, job name will be [async/eval].\n\n#### `async_process_results <worker_name> <callback_function>`\n\nGet results from finished jobs and pass it to the to callback function. This is the only way to reliably return the job name, return code, output and execution time and with minimal effort.\n\nIf the async process buffer becomes corrupt, the callback will be invoked with the first argument being `[async]` (job name), non-zero return code and fifth argument describing the error (stderr).\n\nThe `callback_function` is called with the following parameters:\n\n* `$1` job name, e.g. the function passed to async_job\n* `$2` return code\n  * Returns `-1` if return code is missing, this should never happen, if it does, you have likely run into a bug. Please open a new [issue](https://github.com/mafredri/zsh-async/issues/new) with a detailed description of what you were doing.\n* `$3` resulting (stdout) output from job execution\n* `$4` execution time, floating point e.g. 0.0076138973 seconds\n* `$5` resulting (stderr) error output from job execution\n* `$6` has next result in buffer (0 = buffer empty, 1 = yes)\n  * This means another async job has completed and is pending in the buffer, it's very likely that your callback function will be called a second time (or more) in this execution. It's generally a good idea to e.g. delay prompt updates (`zle reset-prompt`) until the buffer is empty to prevent strange states in ZLE.\n\nPossible error return codes for the job name `[async]`:\n\n* `1` Corrupt worker output.\n* `2` ZLE watcher detected an error on the worker fd.\n* `3` Response from async_job when worker is missing.\n* `130` Async worker crashed, this should not happen but it can mean the file descriptor has become corrupt. This must be followed by a `async_stop_worker [name]` and then the worker and tasks should be restarted. It is unknown why this happens.\n\n#### `async_register_callback <worker_name> <callback_function>`\n\nRegister a callback for completed jobs. As soon as a job is finished, `async_process_results` will be called with the specified callback function. This requires that a worker is initialized with the -n (notify) option.\n\n#### `async_unregister_callback <worker_name>`\n\nUnregister the callback for a specific worker.\n\n#### `async_flush_jobs <worker_name>`\n\nFlush all current jobs running on a worker. This will terminate any and all running processes under the worker by sending a `SIGTERM` to the entire process group, use with caution.\n\n## Example code\n\n```zsh\n#!/usr/bin/env zsh\nsource ./async.zsh\nasync_init\n\n# Initialize a new worker (with notify option)\nasync_start_worker my_worker -n\n\n# Create a callback function to process results\nCOMPLETED=0\ncompleted_callback() {\n\tCOMPLETED=$(( COMPLETED + 1 ))\n\tprint $@\n}\n\n# Register callback function for the workers completed jobs\nasync_register_callback my_worker completed_callback\n\n# Give the worker some tasks to perform\nasync_job my_worker print hello\nasync_job my_worker sleep 0.3\n\n# Wait for the two tasks to be completed\nwhile (( COMPLETED < 2 )); do\n\tprint \"Waiting...\"\n\tsleep 0.1\ndone\n\nprint \"Completed $COMPLETED tasks!\"\n\n# Output:\n#\tWaiting...\n#\tprint 0 hello 0.001583099365234375\n#\tWaiting...\n#\tWaiting...\n#\tsleep 0 0.30631208419799805\n#\tCompleted 2 tasks!\n```\n\n## Testing\n\nTests are located in `*_test.zsh` and can be run by executing the test runner: `./test.zsh`.\n\nExample:\n\n```console\n$ ./test.zsh\nok\t./async_test.zsh\t2.334s\n```\n\nThe test suite can also run specific tasks that match a pattern, for example:\n\n```console\n$ ./test.zsh -v -run zle\n=== RUN   test_zle_watcher\n--- PASS: test_zle_watcher (0.07s)\nPASS\nok\t./async_test.zsh\t0.070s\n```\n\n## Limitations\n\n* A NULL-character (`$'\\0'`) is used by `async_job` to signify the end of the command, it is recommended not to pass them as arguments, although they should work when passing multiple arguments to `async_job` (because of quoting).\n* Tell me? :)\n\n## Tips\n\nIf you do not wish to use the `notify` feature, you can couple `zsh-async` with `zsh/sched` or the zsh `periodic` function for scheduling the worker results to be processed.\n\n## Why did I make this?\n\nI found a great theme for zsh, [Pure](https://github.com/sindresorhus/pure) by Sindre Sorhus. After using it for a while I noticed some graphical glitches due to the terminal being updated by a disowned process. Thus, I became inspired to get my hands dirty and find a solution. I tried many things, coprocesses (seemed too limited by themselves), different combinations of trapping kill-signals, etc. I also had problems with the zsh process ending up in a deadlock due to some zsh bug. After working out the kinks, I ended up with this and thought, hey, why not make it a library."
}
